server/loadTest.yml
config:
  target: 'http://localhost:8000'
  http:
    pool: 10 # All HTTP requests from all virtual users will be sent over the same 10 connections
  phases:
    - duration: 10
      arrivalRate: 6000
      name: "Create 10 virtual users every second for "
  processor: "./loadTest.js"
scenarios:
  - name: "user is purchasing"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/processTrans"
          json:
            userId: "{{ userId }}"
            fullName: "{{ fullName }}"
            phone: "{{ phone }}"
            products: "{{ products }}"
            paymentId: "{{ paymentId }}"
            cartTotal: "{{ cartTotal }}"
            primeTrialSignUp: "{{ primeTrialSignUp }}"
            shippingAddress: "{{ shippingAddress }}"
            billingAddress: "{{ billingAddress }}"


# without queue and multiple servers, for 10 seconds at a 10,000RPS, my average RSP is 108.33
# with queue ->

# with duplicated servers ->

#try to make my response time less


# explore artillery outputs

#  PROBLEM: apm not reporting everything from artillery???
# How to duplicate my server? use docker?






# Format of data it sends to processTrans
# { 
# userId: '1673449',

# fullName: 'Cyril Hegmann V',

# phone: '832-461-3270',

# products: 
#   '[{"productId":86834,"productName":"Generic Cotton Car","price":"636.00","vendorId":24297,"vendorName":"Grady LLC","quantity":4,"isPrimeProduct":"false"}]',

# paymentId: '1903593',

# cartTotal: '811.00',

# primeTrialSignUp: 'false',

# shippingAddress: 
#   '{"addressLine1":"9003 Linnea Turnpike","addressLine2":"Apt. 359","city":"Lake Roxane","state":"Rhode Island","zip":"62476","country":"Palestinian Territory"}',

# billingAddress: 
#   '{"addressLine1":"9003 Linnea Turnpike","addressLine2":"Apt. 359","city":"Lake Roxane","state":"Rhode Island","zip":"62476","country":"Palestinian Territory"}' 
# }